# LinkElementId Constructor (ElementId, ElementId)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkElementId Constructor (ElementId, ElementId)
LinkElementId Class See Also
---
Creates a new LinkElementId representing an element in a linked document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public LinkElementId(
	ElementId linkInstanceId,
	ElementId elementId
)
```

Visual Basic
---
```text
Public Sub New ( _
	linkInstanceId As ElementId, _
	elementId As ElementId _
)
```

Visual C++
---
```text
public:
LinkElementId(
	ElementId^ linkInstanceId,
	ElementId^ elementId
)
```

# ### Parameters
linkInstanceId
    Type: Autodesk.Revit.DB..::..ElementId The id of the linked model element in the host document.
elementId
    Type: Autodesk.Revit.DB..::..ElementId The id of the element in the linked model document.
# See Also
LinkElementId Class
LinkElementId Overload
Autodesk.Revit.DB Namespace